from collections import Counter

#_____________________________1.1_____________________________________________
a = [1, 4, 6, 7, 2, 1, 7, 8, 9, 5, 7, 3, 6, 2, 7, 43, 54, 13]

# Нахождение максимального элемента масива и его индекс
a_max = a[0]
for i in range(len(a)):
    if a[i] > a_max:
        a_max = a[i]

print('Максимальное значение массива равно:' + ' ' + str(a_max))
print('Индекс максимального значения равен:' + ' ' + str(a.index(a_max)))

# Нахождние минимальнго элемента массива и его индекс

a_min = a[0]
for i in range(len(a)):
    if a[i] < a_min:
        a_min = a[i]

print('Минимальное значение массива равно:' + ' ' + str(a_min))
print('Индекс минимального значения равен:' + ' ' + str(a.index(a_min)))

#____________________________1.2________________________________________________

count = Counter(a)

print('Три самых часто встречемых элемента в самиве:')
print(count.most_common()[0])
print(count.most_common()[1])
print(count.most_common()[2])

#_____________________________2.1_____ найти ключи которые есть в обоих словарях______________________________________

a = {'a': 1, 'b': 4, 't': 67}
b = {'c': 4, 'e': 1, 'a': 4, 't': 7, 'y': 11}

list(a.keys())
list(b.keys())
print(list(set(a.keys()) & set(b.keys())))

#_________________________________2.2___найти ключи которые есть только во 2м словаре, но нет в 1м_____________________

print(list(set(a.keys()) ^ set(b.keys())))

#_________________________________2.3_____________________________________________________